/******************************************************************************
 ** Coypright(C) 2014-2024 Xundao technology Co., Ltd
 **
 ** 文件名: list.c
 ** 版本号: 1.0
 ** 描  述: 单向链表的处理(通用单向链表)
 **         通过此处的函数简化单向链表的插入、删除操作，加快开发进程、减少人为
 **         错误.
 ** 作  者: # Qifeng.zou # 2014.08.24 #
 ******************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>

#include "list.h"

/******************************************************************************
 **函数名称: list_assert
 **功    能: 链表检测
 **输入参数: 
 **     list: 单向链表
 **输出参数: NONE
 **返    回: VOID
 **实现描述: 
 **注意事项: 
 **作    者: # Qifeng.zou # 2014.08.24 #
 ******************************************************************************/
void list_assert(list_t *list)
{
    int num = 0;
    list_node_t *curr;

    curr = list->head;
    while (NULL != curr)
    {
        ++num;
        curr = curr->next;
    }

    if (num != list->num)
    {
        abort();
    }
}
